design.mdの図をmermaidの図に修正
